{
    "architectures": [
      ".EsmForTokenClassification"
    ],
    "attention_probs_dropout_prob": 0.0,
    "bos_token_id": 0,
    "classifier_dropout": null,
    "emb_layer_norm_before": false,
    "encoder_keep_prob": 0.88,
    "eos_token_id": 2,
    "esmfold_config": null,
    "gradient_checkpointing": false,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0,
    "hidden_size": 768,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "is_folding_model": false,
    "layer_norm_eps": 1e-05,
    "max_position_embeddings": 1026,
    "model_type": "esm",
    "num_attention_heads": 12,
    "num_hidden_layers": 12,
    "pad_token_id": 1,
    "position_embedding_type": "rotary",
    "torch_dtype": "float32",
    "transformers_version": "4.9.0.dev0",
    "type_vocab_size": 1,
    "use_cache": true,
    "vocab_size": 10,
    "num_labels":3,
    "method": "cls",
    "loss_type":"mcrmse", 
    "valid_seq_len":68, 
    "head_type":"AttentionBPP", 
    "consider_error":false, 
    "alpha":1, 
    "beta":1, 
    "seq_len":107
  }